app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("user_id", "table_id", "start", "end", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["table_id", 1], ["start", "2000-01-01 11:33:00"], ["end", "2000-01-01 16:59:00"], ["created_at", "2019-02-28 11:34:46.981929"], ["updated_at", "2019-02-28 11:34:46.981929"]]